////////////////////////////////////////////////////////////////////////////////////////////////
// Подумать над глобальными сущностями. К примеру, сущность «Продукт» в                       //
// интернет-магазине актуальна не только для корзины, но и для каталога. Стремиться нужно к   //
// тому, чтобы объект «Продукт» имел единую структуру для различных модулей сайта, но в       //
// разных местах давал возможность вызывать разные методы.                                    //
////////////////////////////////////////////////////////////////////////////////////////////////

// Не понял задания, поэтому пишу как понял

// Можно добавить скидку: т.к. клиенты должны ее видеть и во время добавления товара в корзину, и в самой корзине.
// Можно добавить доставку в зависимости от зоны: аналогично, стоимость нужно видеть в во время заказа и в корзине
// Можно добавить склад отгрузки: чтобы можно было посмотреть наличие, или для уведомлений, что поступил товар или наоборот - закончился