//////////////////////////////////////////////////
// ЗАДАНИЕ №5.                                  //
// Нарисовать пирамиду с 20 рядами с помощью    //
// console.log, как показано на рисунке:        //
// x                                            //
// xx                                           //
// xxx                                          //
// xxxx                                         //
// xxxxx                                        //
//////////////////////////////////////////////////

for (let i = 0; i < 20; i++){
    let str = 'x';
    for (let k = 0; k < i; k++){
        str += 'x'
    }
    console.log(str);
}